{
  "newses": [
    {
      "identify": 1,
      "title": "Best Prime Day deals 2019: 4K TV, Echo, and Nintendo Switch discounts",
      "content": "The best Amazon Prime Day deals have finally arrived. 4K TVs, Nintendo Switch bundles, iPads, and more are all on sale during this 48-hour stretch. Now is the time to find the savings you\u0027ve been waiting for.",
      "views": 0
    },
    {
      "identify": 2,
      "title": "Walmart Prime Day sale: 4K TV, Apple Watch, and Nintendo Switch Deals",
      "content": "The Walmart Prime Day sale continues to go strong as the first day of Amazon\u0027s 48-hour deals event comes to a close. There are loads of great Apple Watch, Nintendo Switch, and 4K TV deals going on right now.",
      "views": 2
    },
    {
      "identify": 3,
      "title": "Snag this Philips Twin TurboStar Airfryer for 50% off this Prime Day",
      "content": "From healthy snacks to full family dishes, you can count on the Philips Twin TurboStar XXL Air Fryer for reliable cooking. Order yours today for only $115 instead of $230 on Prime Day.",
      "views": 0
    },
    {
      "identify": 4,
      "title": "We found a Prime Day deal hack that gets you the Echo Show 5 for next to nothing",
      "content": "Even at $50 during Prime Day, the Echo Show 5 is a great deal. But our intrepid deal team has found a Prime Day hack that could snag you one of these devices for literally next to nothing, as long as you have the right Echo to trade in.",
      "views": 0
    },
    {
      "identify": 5,
      "title": "Best Prime Day smartwatch deals: Apple Watch, Fitbit Versa, and Samsung Galaxy",
      "content": "Amazon Prime Day 2019 is finally here, bringing with it a number of great smartwatch deals. Whether you\u0027re into Apple\u0027s Apple Watch, or prefer a smartwatch that has Google\u0027s Wear OS wearable operating system, there should be a something for you.",
      "views": 1
    },
    {
      "identify": 6,
      "title": "The best laptop bags for 2019",
      "content": "Choosing the right laptop bag is no easy feat -- after all, no one likes to second-guess themselves. Here are some of the best laptop bags on the market, from backpacks to sleeves, so you can get it right the first time around.",
      "views": 0
    },
    {
      "identify": 7,
      "title": "Best Prime Day mattress sales: Tempur-Pedic, Sealy, and Amazon deals",
      "content": "The best Prime Day deals are here, and some of the very best discounts this year are on mattresses. With price cuts from Tempur-Pedic, Cocoon, and Helix, now is a great time to score some savings a new bed.",
      "views": 0
    },
    {
      "identify": 8,
      "title": "The best stand-up comedy on Netflix right now (July 2019)",
      "content": "Feeling a little funny? There are hundreds of hilarious comedy specials out there, and you can\u0027t be expected to comb through them all. Lucky for you, we\u0027ve compiled a list of the best stand-up specials on Netflix.",
      "views": 0
    },
    {
      "identify": 9,
      "title": "Amazon cuts 33% off on the HP Sprocket Photo Printer for Prime Day",
      "content": "Amazon Prime Day sale is officially live. The HP Sprocket Plus Instant Photo Printer normally sells for $150, but Amazon cuts $50 off from its original price making it now available for a discounted price of only $100.",
      "views": 0
    },
    {
      "identify": 10,
      "title": "Digital Trends Live: Our comprehensive coverage of Amazon Prime Day 2019",
      "content": "It\u0027s DT Live coverage of Amazon Prime Day. From TVs to computers, gaming, smart home devices, electronics, wearables, and much more, take a walk through this Prime Day with the experts at DT Live.",
      "views": 0
    },
    {
      "identify": 11,
      "title": "This Prime Day Sony PS4 bundle deal comes with God of War and Days Gone",
      "content": "Amazon is currently offering a PS4 Pro bundle with the games God of War and Days Gone at a substantial discount. God of War was one of our favorite games of 2018, and it can be played in 4K on PS4 Pro.",
      "views": 0
    },
    {
      "identify": 12,
      "title": "Amazon Prime Day discounts makes upgrading to RTX graphics even more affordable",
      "content": "Looking to upgrade your graphics card? Today may be the day to do it, thanks to Amazon\u0027s Prime Day shopping event. Amazon is offering Prime members steep discounts off of GeForce RTX 2080 Ti, RTX 2080, or RTX 2070 graphics.",
      "views": 0
    },
    {
      "identify": 13,
      "title": "SpaceX finally knows what caused its Crew Dragon capsule to explode",
      "content": "SpaceX and NASA say they finally know what caused its Crew Dragon capsule to explode during an April test of the spacecraft’s thruster system. It\u0027s now unlikely that the capsule will be used for crewed spaceflight before the end of the year.",
      "views": 0
    },
    {
      "identify": 14,
      "title": "The best Amazon Prime Day deals on dashboard cameras for your car",
      "content": "The dash cam market grows annually, so these devices are rarely on sale. Prime Day 2019 is a stellar opportunity to modernize your car, keep yourself safe behind the wheel, and possibly capture something hilarious on film.",
      "views": 0
    },
    {
      "identify": 15,
      "title": "This Prime Day Lightning Deal on Neato’s D4 robot vacuum saves you 40%",
      "content": "Prime Day 2019 is shaping up to be a banner year for sales on smart home products, including robot vacuums. However, the deal we uncovered for Neato\u0027s D4 Robot Vacuum is time-limited and only while supplies last, so act fast.",
      "views": 0
    },
    {
      "identify": 16,
      "title": "The best mouse deals for Prime Day 2019: Razer, Logitech, and more",
      "content": "This year\u0027s big shopping event, Amazon Prime Day, offers some fantastic discounts on mice. We\u0027ve scoured this year\u0027s sales and made picks for what we think are the best mice you can buy on Prime Day.",
      "views": 0
    },
    {
      "identify": 17,
      "title": "Google Home Mini vs. Amazon Echo Dot: Which is better?",
      "content": "We put the two most popular smart home speakers — the Google Home Mini and the third-generation Amazon Echo Dot — together and tested them on appearance, audio, and abilities. So which should you buy?",
      "views": 0
    },
    {
      "identify": 18,
      "title": "AMD vs. Intel",
      "content": "When it comes to selecting a CPU for your PC, there\u0027s no shortage of chips for you to choose from. With Ryzen, Threadripper, and Core i9 CPUs though, the AMD vs. Intel argument is muddier than ever.",
      "views": 0
    },
    {
      "identify": 19,
      "title": "Best Prime Day gaming deals: Xbox, PS4, and Nintendo Switch sales",
      "content": "Prime Day is here! If you aren\u0027t sure which Prime Day gaming deals are available for PS4, Xbox One, or Nintendo Switch, we have you covered. Now you can get to playing those games at big discounts.",
      "views": 0
    },
    {
      "identify": 20,
      "title": "Best Prime Day 4K TV deals: Sony, TCL, and Vizio get massive price cuts",
      "content": "You don\u0027t have to wait until Black Friday to score a fantastic deal on 4K TV — Amazon Prime Day 2019 has arrived, and with it oodles of discounted top-rated 4K televisions from the likes of Samsung, TCL, and Vizio.",
      "views": 0
    },
    {
      "identify": 21,
      "title": "The best graphics cards for 2019",
      "content": "If you\u0027re serious about games, a good graphics card is essential. There’s no one-size-fits-all option for graphics cards, but our recommendations can help you pick from the best graphics cards for your needs.",
      "views": 0
    },
    {
      "identify": 22,
      "title": "Searching for a projector? Don’t miss these awesome Prime Day 2019 deals",
      "content": "Amazon has discounted several top-rated projectors from the likes of Epson, Optoma, and Sony to celebrate Prime Day 2019, including the must-have 4K Optoma UHD51A.",
      "views": 0
    },
    {
      "identify": 23,
      "title": "Player-made mod brings an Easy Mode to Sekiro: Shadow Die Twice",
      "content": "The FromSoftware developers skipped on improving the accessibility of Sekiro: Shadows Die Twice, but someone has created Sekiro The Easy, a mod that changes player abilities, enemy stats, and more to make it a bit easier to complete.",
      "views": 0
    },
    {
      "identify": 24,
      "title": "The Best Prime Day smartwatch deals: Fitbit, Samsung, and Apple Watch discounts",
      "content": "Amazon Prime Day 2019 is around the corner, and while there are likely to be deals on TVs, gaming consoles, and more, there will also likely be some great deals on smartwatches. Here\u0027s what we know about all the smartwatch deals.",
      "views": 0
    },
    {
      "identify": 25,
      "title": "Prime Day brings out the best deals on Amazon’s Kindle and Fire tablets",
      "content": "Amazon Prime Day 2019 is here, and it brings with it some of the best deals on all kinds of tech products. Notably, Amazon\u0027s Kindle and Fire tablet range of devices have gotten some pretty major discounts,.",
      "views": 0
    },
    {
      "identify": 26,
      "title": "You can get a 2018 MacBook Air for just $999 with this latest deal from B\u0026H",
      "content": "Other retailers like B\u0026#038;H are offering their own sweet laptop deals during Prime Day 2019. In fact, you can score a 13-inch 2018 MacBook Air with a Retina display at a $100 discount from B\u0026#038;H right now.",
      "views": 0
    },
    {
      "identify": 27,
      "title": "The best sous vide: Anova vs. Joule",
      "content": "Anova vs. Joule: Which sous vide device is right for you? Our guide goes through important features, power, smart abilities, pricing and more to see what model comes out on top for your culinary projects.",
      "views": 0
    },
    {
      "identify": 28,
      "title": "Sonos One and Sonos Beam get huge Amazon Prime Day discounts up to $140",
      "content": "Sonos\u0027 two smart speaker products, the Sonos One and Sonos Beam, have been discounted for Prime Day, but Amazon has also thrown in some $50 gift cards to make these deals even better.",
      "views": 0
    },
    {
      "identify": 29,
      "title": "Watch live: Buzz Aldrin and Michael Collins reflect on the moon landing",
      "content": "To celebrate the 50th anniversary of the famous Apollo 11 mission, NASA will hold a live broadcast featuring a retrospective and presentations by the astronauts involved. You can watch the event live on July 16 at 6:15 a.m. PT.",
      "views": 0
    },
    {
      "identify": 30,
      "title": "Price plummets on the Dyson V7 Animal Pro+ cordless vacuum on Prime Day",
      "content": "Dyson has homes with pets in mind with the V7 Animal Pro+ cordless vacuum. This versatile stick vac comes with extra cleaning tools for the whole house. You can get up to 30 solid minutes of cleaning power with the rechargeable battery.",
      "views": 0
    }
  ]
}