{
  "newses": [
    {
      "identify": "2359475",
      "title": "Digital Trends",
      "content": "It is now possible to read a book on an electronic device, like the Kindle Paperwhite. Right now, it is getting an awesome discount on Amazon’s Prime Day – from $130 to the low price of $85.",
      "views": 0
    },
    {
      "identify": "2359095",
      "title": "The Google Pixel 3 XL is $250 off for Prime Day",
      "content": "The Google Pixel 3 XL is one of the best phones of the last year, thanks to the fact that it has an amazing camera and super smart artificial intelligence features. For Amazon Prime Day 2019, the device has been discounted by around a hefty $250.",
      "views": 0
    },
    {
      "identify": "798296",
      "title": "Best Prime Day deals 2019: Walmart, Apple iPad, and 4K TV discounts",
      "content": "The best Amazon Prime Day deals have finally arrived. 4K TVs, Nintendo Switch bundles, iPads, and more are all on sale during this 48-hour stretch. Now is the time to find the savings you\u0027ve been waiting for.",
      "views": 3
    },
    {
      "identify": "2358849",
      "title": "Amazon drops 55% off deal on Sony wireless noise-canceling headphones for Prime Day",
      "content": "Bless your Monday morning with a 55% price cut on the Sony Wireless Noise Canceling Headphones WH-CH700N. Normally priced at $198, this awesome pair of headphones can be yours for only $90.",
      "views": 1
    },
    {
      "identify": "2359085",
      "title": "Instant Pots get hefty price cuts for Prime Day including the smart wifi cooker",
      "content": "Having an Instant Pot at home not only saves you time and energy on your cooking, but it saves you counter space as well. For Prime Day, Amazon is slashing the price of three Instant Pot models by up to 54%. Get yours today.",
      "views": 0
    },
    {
      "identify": "2359102",
      "title": "The best Motorola smartphone deals for Amazon Prime Day",
      "content": "Amazon Prime Day 2019 is here, and there are some awesome deals on smartphones, especially when it comes to Motorola\u0027s range of devices. For Prime Day 2019, Motorola has discounted phones like the Moto Z3 Play, Moto G7, and more.",
      "views": 0
    },
    {
      "identify": "2359226",
      "title": "The best Apple iPhone deals for Amazon Prime Day",
      "content": "Amazon Prime Day 2019 is here, and there are a number of great iPhone deals available during the event. You can even get a deal on Apple\u0027s latest and greatest big-screen phone, the iPhone XS Max.",
      "views": 0
    },
    {
      "identify": "2358281",
      "title": "Qualcomm\u0026#8217;s Snapdragon 855 Plus brings a performance boost to flagship phones",
      "content": "Qualcomm is giving a modest performance boost to the Snapdragon 855. The company has taken the wraps off of the new Snapdragon 855 Plus, which offers a few new features over the original Snapdragon 855.",
      "views": 0
    },
    {
      "identify": "2358816",
      "title": "Amazon drops Prime Day deal on Kasa Spot Indoor Security Camera, now just $35",
      "content": "The Kasa Spot Indoor Camera is a reliable and budget-friendly way to add extra protection to your home. For Prime Day, Amazon made it even more affordable for only $35. Hurry and take advantage of this limited-time offer.",
      "views": 0
    },
    {
      "identify": "2358808",
      "title": "The Kasa Cam Outdoor sees a price drop for Prime Day, now only $72",
      "content": "The Kasa Cam Outdoor sports excellent specifications at a price tag that’s not too heavy on the wallet. Whether you’re building a new home surveillance system or planning to update your existing setup, look no further.",
      "views": 0
    },
    {
      "identify": "2359096",
      "title": "Breville coffeemakers get over 50% off discount for Amazon Prime Day",
      "content": "Looking for a no-frills drip coffee maker that will save you time and energy in the morning? Now\u0027s your chance to score amazing deals from the kitchen appliance company Breville. Take advantage of these limited time offers.",
      "views": 0
    },
    {
      "identify": "2359122",
      "title": "This Breville Smart Toaster Oven gets a 28% price cut in time for Prime Day",
      "content": "Get Breville\u0027s Compact Smart Oven (BOV650XL) for 28% less than its usual price of $180 on Amazon. Just be sure to hold up your end of the deal while the offer stands till 3:30 p.m. today.",
      "views": 0
    },
    {
      "identify": "2358853",
      "title": "Arlo Pro home security cameras get steep discounts for Amazon Prime Day",
      "content": "Outdoor security cameras rank as one of the most frequently added smart home devices and Arlo\u0027s rechargeable indoor/outdoor wireless cameras are highly rated. Amazon dropped the prices on three Arlo Pro camera options for Prime Day 2019.",
      "views": 0
    },
    {
      "identify": "2356782",
      "title": "Amazon makes deep price cuts on myQ Smart Garage Hub deals for Prime Day 2019",
      "content": "We were excited when Amazon dropped the price for the myQ Smart Garage Opener hub in early June and the deal is even sweeter for Prime Day 2019. Amazon bundles the myQ hub with a Cloud Cam indoor security camera in a second awesome deal.",
      "views": 0
    },
    {
      "identify": "2359219",
      "title": "You can unlock Lincoln\u0026#8217;s massive 2020 Navigator with your phone",
      "content": "The 2020 Lincoln Navigator adds a phone-as-key feature that lets the driver use a smartphone in place of a traditional key fob. Other changes for 2020 include more standard convenience features, and some new trim packages.",
      "views": 0
    },
    {
      "identify": "2358845",
      "title": "This SimpliSafe Security System kit gets a 30% price cut for Amazon’s Prime Day",
      "content": "With high-performing sensors and excellent monitoring solutions, the SimpliSafe Wireless Security System hits all the right marks in 24/7 home protection. Normally $550, Amazon’s Prime Day deal cuts its price down to $385.",
      "views": 0
    },
    {
      "identify": "2358454",
      "title": "The best Prime Day smartphone deals: Samsung, Motorola, Google, and more",
      "content": "Amazon Prime Day 2019 is here, and there are a ton of great deals on smartphones worth looking into. Whether you\u0027re looking for a new iPhone or an Android device, there should be a Prime Day 2019 deal for you.",
      "views": 0
    },
    {
      "identify": "2356912",
      "title": "The best Sony PS4 deals for Amazon Prime Day 2019",
      "content": "Amazon\u0027s Prime Day includes big savings on PS4 games, consoles, and accessories, and this year the event lasts two days. These are the best Prime Day PS4 deals available right now.",
      "views": 0
    },
    {
      "identify": "2358101",
      "title": "Best Prime Day 4K TV deals: Sony, TCL, and Vizio get price cuts",
      "content": "You don\u0027t have to wait until Black Friday to score a fantastic deal on 4K TV — Amazon Prime Day 2019 has arrived, and with it oodles of discounted top-rated 4K televisions from the likes of Samsung, TCL, and Vizio.",
      "views": 0
    },
    {
      "identify": "2358855",
      "title": "Amazon cuts prices on Google Wi-Fi mesh network router for Prime Day",
      "content": "Amazon cut prices on Google Wi-Fi mesh wireless network devices for Prime Day 2019. Google Wi-Fi systems mesh network routers are expandable. If you use a conventional router and want faster Wi-Fi, these deals can help you save.",
      "views": 0
    },
    {
      "identify": "2359169",
      "title": "Amazon cuts up to 69% off prices of Kasa smart plugs and more for Prime Day",
      "content": "July 15 marks the start of Prime Day 2019. Kicking things off at 12 a.m. PT are these price cuts on Kasa products. Get up to 69% off these smart home devices when you order through July 16.",
      "views": 0
    },
    {
      "identify": "2359310",
      "title": "The Eero Pro Wi-Fi system is $200 off in early Amazon Prime Day deal",
      "content": "Amazon Prime Day is a fine time to upgrade your home Wi-Fi system. Now, Amazon Prime members only can secure an early Prime Day deal on a mesh network wireless router, with the Eero Pro Wi-Fi system now just $299.",
      "views": 0
    },
    {
      "identify": "2359425",
      "title": "Airport hotel builds a full-sized flight simulator into one of its guest rooms",
      "content": "Aviation enthusiasts flying out of Tokyo\u0027s Haneda Airport, there\u0027s a new hotel room designed just for you. It features a full-sized Boeing 737-800 flight simulator, though you\u0027ll have to pay extra to use it.",
      "views": 0
    },
    {
      "identify": "2359068",
      "title": "Amazon Prime Day drops deal on Razor EcoSmart Metro Electric Scooter",
      "content": "The Razor EcoSmart Metro Electric Scooter is easy to assemble, easy to ride, and has great battery life and a top speed of 18 mph. With a Prime Day 2019 sale taking 46% off the normal price, it\u0027s now much easier on the pocketbook, too.",
      "views": 0
    },
    {
      "identify": "2359140",
      "title": "Amazon Prime Day sees up to 40% discounts on Sengled Smart LED Kits and Bulbs",
      "content": "Prime Day 2019 is finally upon us. Amazon is opening this highly anticipated sale with discounts on Sengled smart lighting kits and bulbs. Get up to 40% off these smart lighting products if you order on July 15 or 16.",
      "views": 0
    },
    {
      "identify": "2357699",
      "title": "Best Prime Day Apple deals: iPads, MacBooks, and Apple Watches",
      "content": "Prime Day is officially here, and there are still some nice Apple deals to be had during Amazon\u0027s big event. We rounded up a few right here, along with a quick and handy guide detailing what Apple deals you can expect to find.",
      "views": 0
    },
    {
      "identify": "2359043",
      "title": "Prime Day brings deep discounts on Segway Scooters, Hovershoes, and Transporters",
      "content": "Segway\u0027s nearly decade of experience gives its parent company Ninebot a distinct advantage over its competitors, and it has come out with some pretty neat scooters and hoverboards as a result.",
      "views": 0
    },
    {
      "identify": "2347812",
      "title": "Best Prime Day Apple deals: iPad, MacBook, and AirPods discounts",
      "content": "Prime Day is officially here, and there are still some nice Apple deals to be had during Amazon\u0027s big event. We’ve rounded up iPads, Macbooks, and more, along with a quick and handy guide detailing what Apple deals you can expect to find.",
      "views": 0
    },
    {
      "identify": "2358857",
      "title": "Amazon slashes prices for LectroFan white noise sound machines for Prime Day",
      "content": "It\u0027s a noisy world out there and sometimes masking the noise is the only way you can concentrate, relax, or go to sleep. Amazon slashed the price of three Adaptive Sound Technologies LectroFan sound machines for Amazon Prime Day 2019.",
      "views": 0
    },
    {
      "identify": "2359105",
      "title": "Amazon cuts prices of Sengled Smart LED Starter Kits by up to 40% on Prime Day",
      "content": "Amazon Prime Day 2019 is here. One of the first dishes being served is these Sengled Smart LED Started Kit deals. You can get a 33% discount on the four-bulb pack and a 40% discount on the two-bulb pack.",
      "views": 0
    }
  ]
}