{
  "newses": [
    {
      "identify": 1,
      "title": "Grab the Dolby Dimensions wireless headphones for $200 less after Prime Day",
      "content": "Dolby has made its very first self-branded product in the form the Dolby Dimensions wireless headphones and as expected, it delivers. You can get the Dimensions on Amazon for $399 – $200 less than its normal retail price of $600.",
      "views": 0
    },
    {
      "identify": 2,
      "title": "How to change your Outlook password",
      "content": "Keeping your digital accounts locked up with strong, unique passwords is important, so learning how to change your Outlook password quickly and easily is one of the best ways to stay safe online.",
      "views": 0
    },
    {
      "identify": 3,
      "title": "Ride in style with the Xiaomi Mi electric scooter for $97 less post-Prime Day",
      "content": "Scooters started out as a plaything for kids. But now they are larger and have become a common and efficient means to commute, like the Xiaomi Mi electric scooter. It\u0027s available on Amazon as a post-Prime Day deal for $97 less.",
      "views": 0
    },
    {
      "identify": 4,
      "title": "Fujifilm’s newest medium format lens is lighter than a can of soda",
      "content": "Medium format is notorious for both image quality and bulk, but Fujifilm is continuing to press the advanced cameras into smaller sizes with the launch of the Fujinon GFX 50mm F3.5. The lens is the lightest Fujifilm medium format lens yet.",
      "views": 0
    },
    {
      "identify": 5,
      "title": "The best Oculus Quest games",
      "content": "The Oculus Quest offers a fantastic virtual reality experience without the need for a PC or console tethered to your headset. These are the best Oculus Quest games available right now.",
      "views": 0
    },
    {
      "identify": 6,
      "title": "Lounge in nature with the Coleman Steel Creek tent, now 43% off post-Prime Day",
      "content": "Nothing can be more infuriating than dealing with a terrible tent while camping. Luckily, there are a lot of great tents to choose from, like the Coleman Steel Creek dome tent. Amazon has slashed 43% off its original price, bringing it down to $130.",
      "views": 0
    },
    {
      "identify": 7,
      "title": "The Honeywell Portable Air Conditioner gets a 20% price cut on Amazon",
      "content": "Prime Day may have gone by but Amazon still has cool deals up for grabs. Keep your cool with a Honeywell Portable Air Conditioner that is currently selling for $115 less than its typical list price of $550. ",
      "views": 0
    },
    {
      "identify": 8,
      "title": "Walmart drops up to 47% off on discounts for Remington Hair Dryers",
      "content": "If you’re in need of new blow dryers but missed out on the Prime Day deals, worry no more. Walmart has reduced the price of Remington hair dryers for up to 47%. We’ve rounded them up here so you can check it all out.",
      "views": 0
    },
    {
      "identify": 9,
      "title": "Hasselblad’s CFV II and 907X are a modern take on a photography classic",
      "content": "Hasselblad has announced a special edition of the CFV II 50C digital back a 907X camera body before either is available to buy or has even been priced. The camera offers a striking matte black finish, but is technically identical.",
      "views": 0
    },
    {
      "identify": 10,
      "title": "AT\u0026T accused of selling customers’ location data to bounty hunters and stalkers",
      "content": "AT\u0026#038;T was hit with a lawsuit Tuesday accusing it of selling customers’ real-time location data to third parties like credit agencies and bail guarantors, along with bounty hunters and stalkers, without having customer consent. ",
      "views": 0
    },
    {
      "identify": 11,
      "title": "These 6 popular browser extensions are selling your data",
      "content": "Some popular browser extensions are collecting and selling your data, according to a a new investigation. The extensions in question are Hover Zoom, SpeakIt!, SuperZoom, SaveFrom.net Helper, FairShare Unlock and PanelMeasurement.",
      "views": 0
    },
    {
      "identify": 12,
      "title": "Sony WF-1000XM3 vs. Sennheiser Momentum vs. Klipsch T5 True Wireless headphones",
      "content": "We\u0027ve been testing three of the most popular premium true wireless earbuds against each other. In our comparison of the Sony Wf-1000XM3, Sennheiser Momentum, and Klipsch T5 True Wireless, we compare sound, comfort, and style.",
      "views": 0
    },
    {
      "identify": 13,
      "title": "Cadillac’s new 2020 CT5 sedan lets you Super Cruise across America",
      "content": "The 2020 Cadillac CT5 proves the General Motors-owned luxury brand still cares about sedans. Introduced at the 2019 New York Auto Show, it\u0027s optionally available with Cadillac\u0027s Super Cruise technology and a lineup of turbocharged engines.",
      "views": 0
    },
    {
      "identify": 14,
      "title": "It: Chapter Two trailer brings Pennywise back with plenty of nightmare fuel",
      "content": "Warner Bros. Pictures has released a new, terrifying trailer for It: Chapter Two, the upcoming sequel to the 2017 film It. Both films are based on the novel of the same name written by Stephen King.",
      "views": 0
    },
    {
      "identify": 15,
      "title": "The best indie games",
      "content": "These days, some of the best video games are made by independent studios. Here are 25 of the best indie games, whether you prefer grueling dungeon crawlers or otherworldly, meditative adventures.",
      "views": 0
    },
    {
      "identify": 16,
      "title": "Grill with Philips’ smokeless indoor grill, now 48% off after Prime Day",
      "content": "Fact: Americans love grilled food. If you have one, the problem is the smoke, which your neighbors may not like. The solution is a smokeless indoor grill, like the Philips Avance Indoor Grill. Get it post-Prime Day at 48% off for only $150.",
      "views": 0
    },
    {
      "identify": 17,
      "title": "How Lexus, one of the industry’s hybrid champions, is preparing for the 2020s",
      "content": "Lexus predicts significant shifts will reshape the automotive industry during the 2020s. The hybrid champion is preparing to branch out into electric cars, it\u0027s investing in autonomous technology, and it wants to keep focusing on SUVs.",
      "views": 0
    },
    {
      "identify": 18,
      "title": "The best video doorbells for 2019",
      "content": "When it comes to knowing who\u0027s at your door before you actually open it, there\u0027s nothing better than a video doorbell. Plus, you can \"answer\" the door even if you\u0027re not home. Here are some of our favorites.",
      "views": 0
    },
    {
      "identify": 19,
      "title": "Huawei Mate 30 Pro render shows 2019 really is all about weird camera arrays",
      "content": "The Huawei Mate 30 and Mate 30 Pro may join the Mate X folding phone as the company\u0027s star products for late 2019. This is what we know about the Huawei Mate 30 and Mate 30 Pro so far.",
      "views": 0
    },
    {
      "identify": 20,
      "title": "Save up to $300 on the Apple 10.5-inch iPad Pro at Walmart",
      "content": "The 10.5-inch iPad Pro excels in nearly every aspect, making it a worthwhile investment especially for artists and professionals. You can order the 64GB version for only $474 or the 512GB version for $699 on Walmart.",
      "views": 0
    },
    {
      "identify": 21,
      "title": "Walmart cuts price of this LG 65-inch 4K TV by $220 after Prime Day",
      "content": "In the market for a solid, budget-friendly 4K TV but missed out on the Prime Day offers? worry not. Walmart has an ongoing special summer sale on numerous 4K models, including the LG 65-inch Class 4K Ultra HD Smart LED HDR TV.",
      "views": 0
    },
    {
      "identify": 22,
      "title": "Walmart post-Prime Day sale: 4K TV, Apple, and Nintendo Switch deals",
      "content": "Prime Day 2019 has come to an end for Amazon, but that doesn\u0027t mean the deals are over. Walmart\u0027s Prime Day sale. Walmart\u0027s Prime Day sale lasts all day today, extending a whole extra day beyond Amazon\u0027s shopping extravaganza.",
      "views": 0
    },
    {
      "identify": 23,
      "title": "Gear up for your camping trip with the Coleman Fast Pitch Tent, now only $139",
      "content": "Whether you’re staying in your own backyard or heading out to the wilderness, the Coleman Tenaya Lake Fast Pitch 8-Person Cabin Tent is a reliable companion for almost any kind of outdoor adventure. Get yours for only $139.",
      "views": 0
    },
    {
      "identify": 24,
      "title": "Implant restores sight in blind patients by beaming images directly to the brain",
      "content": "Engineers have developed a neural implant which could help restore vision for completely blind people by bypassing non-functioning optical nerves and inputting images directly into their brains.",
      "views": 0
    },
    {
      "identify": 25,
      "title": "Verizon 5G rollout: Here is everything you need to know",
      "content": "Verizon is in the midst of a massive 5G rollout. Its mobile 5G network is now available in select areas of several cities such as Chicago and Denver. Here\u0027s everything you need to know about Verizon\u0027s 5G network.",
      "views": 0
    },
    {
      "identify": 26,
      "title": "How to figure out what size TV you should buy",
      "content": "What size TV do you need? Here are a few tips for picking the right size, including where to find a TV’s measurements, ideal viewing distance, and picture quality versus size. Not sure what to look for? This guide is for you.",
      "views": 0
    },
    {
      "identify": 27,
      "title": "Best post-Prime Day deals 2019: 4K TV, wireless earbuds, and Walmart discounts",
      "content": "Prime Day 2019 has come to an end for Amazon, but that doesn\u0027t mean the Prime Day deals are over. With deals from Walmart, Best Buy, and Amazon still going on, this massive shopping event is continuing on through the week.",
      "views": 0
    },
    {
      "identify": 28,
      "title": "Here are the best Dolby Atmos movies for your home theater",
      "content": "If you\u0027ve got your hands on some sweet Dolby Atmos gear, the next step is to find films that take advantage of it. These are our picks in several genres for the best Dolby Atmos movies currently available on Blu-ray and streaming services.",
      "views": 0
    },
    {
      "identify": 29,
      "title": "How much is Spotify Premium, and how can you get it at a discount?",
      "content": "Having access to millions of songs comes at a price -- albeit, a pretty small one. Before you figure out how much Spotify Premium is going to cost, you will want to see if you qualify for a discounted (or even free) subscription.",
      "views": 0
    },
    {
      "identify": 30,
      "title": "Stay cool this summer with these hot ceiling fan deals from Amazon",
      "content": "Fighting the heat of the sun usually means installing an air conditioner, but if you’re trying to avoid excessive energy bills, ceiling fans are a solid option. Check out these hot post-Prime Day ceiling fan deals on Amazon.",
      "views": 0
    }
  ]
}